'use strict'

module.exports = {

    /**
     * 必选参数缺失
     */
    '缺少必要参数': '缺少必要参数',

    "节点名已经存在": "节点名已经存在",

    "节点域名已经存在": "节点域名已经存在",

    '缺少有效资源信息': '缺少有效资源信息',

    '缺少有效节点信息': '缺少有效节点信息',

    '参数%s格式校验失败': '参数%s格式校验失败',

    '参数%s校验失败': '参数%s校验失败',

    '参数%s错误或者没有操作权限': '参数%s错误或者没有操作权限',

    '已签约的节点资源不允许删除': '已签约的节点资源不允许删除',

    '未找到节点资源或者没有权限': '未找到节点资源或者没有权限',

    '原资源未提供包含presentable授权的策略,无法上线': '原资源未提供包含presentable授权的策略,无法上线',

    "节点信息未找到或者与身份信息不匹配": "节点信息未找到或者与身份信息不匹配",

    "参数id错误或者与当前用户不匹配": "参数id错误或者与当前用户不匹配",

    "已经添加的节点资源,不能重复添加": "已经添加的节点资源,不能重复添加",

    '参数key命名规则错误': '参数key命名规则错误',

    '当前key已经存在,不能重复创建': '当前key已经存在,不能重复创建',

    '当前key不存在,不能执行更新操作': '当前key不存在,不能执行更新操作',

    '已上线的节点资源最少需要一个有效的授权策略': '已上线的节点资源最少需要一个有效的授权策略',

    '合同数据校验失败,缺失完整性': '合同数据校验失败,缺失完整性',

    '同一个资源只能选择一个策略或者合同': '同一个资源只能选择一个策略或者合同',

    '合同信息与资源信息或者节点信息不匹配': '合同信息与资源信息或者节点信息不匹配',

    '授权方案%s不可用': '授权方案%s不可用',

    'resourceId与authSchemeId不匹配': 'resourceId与authSchemeId不匹配',

    '合同中存在无效的资源数据': '合同中存在无效的资源数据',

    '授权树数据完整性校验失败': '授权树数据完整性校验失败',

    '未能找到需要更新的策略段': '未能找到需要更新的策略段',

    '不能添加已经存在的策略段': '不能添加已经存在的策略段',

    '未解决全部上抛的资源,不能上线资源': '未解决全部上抛的资源,不能上线资源',

    '不存在有效的策略,不能上线资源': '不存在有效的策略,不能上线资源',

    '资源的部分合同未获得授权': '资源的部分合同未获得授权',

    '授权方案策略编译失败%s': '授权方案策略编译失败%s',

    '节点域名长度必须在$s个之间': '节点域名长度必须在%s个之间',

    '节点域名只能由英文字母,数字和 "-" 组成': '节点域名只能由英文字母,数字和 "-" 组成',

    '节点域名不能以"-"结尾': '节点域名不能以"-"结尾',

    '节点域名不能注册系统保留字段': '节点域名不能注册系统保留字段'
}